[ResNetFPN] Network summary...
================================================================
input (1, 3, 384, 384)
----------------------------------------------------------------
stage1: torch.Size([2, 64, 192, 192])
stage2: torch.Size([2, 256, 96, 96])
stage3: torch.Size([2, 512, 48, 48])
stage4: torch.Size([2, 1024, 24, 24])
stage5: torch.Size([2, 2048, 12, 12])
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [1, 64, 192, 192]           9,408
       BatchNorm2d-2          [1, 64, 192, 192]             128
              ReLU-3          [1, 64, 192, 192]               0
         MaxPool2d-4            [1, 64, 96, 96]               0
            Conv2d-5            [1, 64, 96, 96]           4,096
       BatchNorm2d-6            [1, 64, 96, 96]             128
              ReLU-7            [1, 64, 96, 96]               0
            Conv2d-8            [1, 64, 96, 96]          36,864
       BatchNorm2d-9            [1, 64, 96, 96]             128
             ReLU-10            [1, 64, 96, 96]               0
           Conv2d-11           [1, 256, 96, 96]          16,384
      BatchNorm2d-12           [1, 256, 96, 96]             512
           Conv2d-13           [1, 256, 96, 96]          16,384
      BatchNorm2d-14           [1, 256, 96, 96]             512
             ReLU-15           [1, 256, 96, 96]               0
       Bottleneck-16           [1, 256, 96, 96]               0
           Conv2d-17            [1, 64, 96, 96]          16,384
      BatchNorm2d-18            [1, 64, 96, 96]             128
             ReLU-19            [1, 64, 96, 96]               0
           Conv2d-20            [1, 64, 96, 96]          36,864
      BatchNorm2d-21            [1, 64, 96, 96]             128
             ReLU-22            [1, 64, 96, 96]               0
           Conv2d-23           [1, 256, 96, 96]          16,384
      BatchNorm2d-24           [1, 256, 96, 96]             512
             ReLU-25           [1, 256, 96, 96]               0
       Bottleneck-26           [1, 256, 96, 96]               0
           Conv2d-27            [1, 64, 96, 96]          16,384
      BatchNorm2d-28            [1, 64, 96, 96]             128
             ReLU-29            [1, 64, 96, 96]               0
           Conv2d-30            [1, 64, 96, 96]          36,864
      BatchNorm2d-31            [1, 64, 96, 96]             128
             ReLU-32            [1, 64, 96, 96]               0
           Conv2d-33           [1, 256, 96, 96]          16,384
      BatchNorm2d-34           [1, 256, 96, 96]             512
             ReLU-35           [1, 256, 96, 96]               0
       Bottleneck-36           [1, 256, 96, 96]               0
           Conv2d-37           [1, 128, 96, 96]          32,768
      BatchNorm2d-38           [1, 128, 96, 96]             256
             ReLU-39           [1, 128, 96, 96]               0
           Conv2d-40           [1, 128, 48, 48]         147,456
      BatchNorm2d-41           [1, 128, 48, 48]             256
             ReLU-42           [1, 128, 48, 48]               0
           Conv2d-43           [1, 512, 48, 48]          65,536
      BatchNorm2d-44           [1, 512, 48, 48]           1,024
           Conv2d-45           [1, 512, 48, 48]         131,072
      BatchNorm2d-46           [1, 512, 48, 48]           1,024
             ReLU-47           [1, 512, 48, 48]               0
       Bottleneck-48           [1, 512, 48, 48]               0
           Conv2d-49           [1, 128, 48, 48]          65,536
      BatchNorm2d-50           [1, 128, 48, 48]             256
             ReLU-51           [1, 128, 48, 48]               0
           Conv2d-52           [1, 128, 48, 48]         147,456
      BatchNorm2d-53           [1, 128, 48, 48]             256
             ReLU-54           [1, 128, 48, 48]               0
           Conv2d-55           [1, 512, 48, 48]          65,536
      BatchNorm2d-56           [1, 512, 48, 48]           1,024
             ReLU-57           [1, 512, 48, 48]               0
       Bottleneck-58           [1, 512, 48, 48]               0
           Conv2d-59           [1, 128, 48, 48]          65,536
      BatchNorm2d-60           [1, 128, 48, 48]             256
             ReLU-61           [1, 128, 48, 48]               0
           Conv2d-62           [1, 128, 48, 48]         147,456
      BatchNorm2d-63           [1, 128, 48, 48]             256
             ReLU-64           [1, 128, 48, 48]               0
           Conv2d-65           [1, 512, 48, 48]          65,536
      BatchNorm2d-66           [1, 512, 48, 48]           1,024
             ReLU-67           [1, 512, 48, 48]               0
       Bottleneck-68           [1, 512, 48, 48]               0
           Conv2d-69           [1, 128, 48, 48]          65,536
      BatchNorm2d-70           [1, 128, 48, 48]             256
             ReLU-71           [1, 128, 48, 48]               0
           Conv2d-72           [1, 128, 48, 48]         147,456
      BatchNorm2d-73           [1, 128, 48, 48]             256
             ReLU-74           [1, 128, 48, 48]               0
           Conv2d-75           [1, 512, 48, 48]          65,536
      BatchNorm2d-76           [1, 512, 48, 48]           1,024
             ReLU-77           [1, 512, 48, 48]               0
       Bottleneck-78           [1, 512, 48, 48]               0
           Conv2d-79           [1, 256, 48, 48]         131,072
      BatchNorm2d-80           [1, 256, 48, 48]             512
             ReLU-81           [1, 256, 48, 48]               0
           Conv2d-82           [1, 256, 24, 24]         589,824
      BatchNorm2d-83           [1, 256, 24, 24]             512
             ReLU-84           [1, 256, 24, 24]               0
           Conv2d-85          [1, 1024, 24, 24]         262,144
      BatchNorm2d-86          [1, 1024, 24, 24]           2,048
           Conv2d-87          [1, 1024, 24, 24]         524,288
      BatchNorm2d-88          [1, 1024, 24, 24]           2,048
             ReLU-89          [1, 1024, 24, 24]               0
       Bottleneck-90          [1, 1024, 24, 24]               0
           Conv2d-91           [1, 256, 24, 24]         262,144
      BatchNorm2d-92           [1, 256, 24, 24]             512
             ReLU-93           [1, 256, 24, 24]               0
           Conv2d-94           [1, 256, 24, 24]         589,824
      BatchNorm2d-95           [1, 256, 24, 24]             512
             ReLU-96           [1, 256, 24, 24]               0
           Conv2d-97          [1, 1024, 24, 24]         262,144
      BatchNorm2d-98          [1, 1024, 24, 24]           2,048
             ReLU-99          [1, 1024, 24, 24]               0
      Bottleneck-100          [1, 1024, 24, 24]               0
          Conv2d-101           [1, 256, 24, 24]         262,144
     BatchNorm2d-102           [1, 256, 24, 24]             512
            ReLU-103           [1, 256, 24, 24]               0
          Conv2d-104           [1, 256, 24, 24]         589,824
     BatchNorm2d-105           [1, 256, 24, 24]             512
            ReLU-106           [1, 256, 24, 24]               0
          Conv2d-107          [1, 1024, 24, 24]         262,144
     BatchNorm2d-108          [1, 1024, 24, 24]           2,048
            ReLU-109          [1, 1024, 24, 24]               0
      Bottleneck-110          [1, 1024, 24, 24]               0
          Conv2d-111           [1, 256, 24, 24]         262,144
     BatchNorm2d-112           [1, 256, 24, 24]             512
            ReLU-113           [1, 256, 24, 24]               0
          Conv2d-114           [1, 256, 24, 24]         589,824
     BatchNorm2d-115           [1, 256, 24, 24]             512
            ReLU-116           [1, 256, 24, 24]               0
          Conv2d-117          [1, 1024, 24, 24]         262,144
     BatchNorm2d-118          [1, 1024, 24, 24]           2,048
            ReLU-119          [1, 1024, 24, 24]               0
      Bottleneck-120          [1, 1024, 24, 24]               0
          Conv2d-121           [1, 256, 24, 24]         262,144
     BatchNorm2d-122           [1, 256, 24, 24]             512
            ReLU-123           [1, 256, 24, 24]               0
          Conv2d-124           [1, 256, 24, 24]         589,824
     BatchNorm2d-125           [1, 256, 24, 24]             512
            ReLU-126           [1, 256, 24, 24]               0
          Conv2d-127          [1, 1024, 24, 24]         262,144
     BatchNorm2d-128          [1, 1024, 24, 24]           2,048
            ReLU-129          [1, 1024, 24, 24]               0
      Bottleneck-130          [1, 1024, 24, 24]               0
          Conv2d-131           [1, 256, 24, 24]         262,144
     BatchNorm2d-132           [1, 256, 24, 24]             512
            ReLU-133           [1, 256, 24, 24]               0
          Conv2d-134           [1, 256, 24, 24]         589,824
     BatchNorm2d-135           [1, 256, 24, 24]             512
            ReLU-136           [1, 256, 24, 24]               0
          Conv2d-137          [1, 1024, 24, 24]         262,144
     BatchNorm2d-138          [1, 1024, 24, 24]           2,048
            ReLU-139          [1, 1024, 24, 24]               0
      Bottleneck-140          [1, 1024, 24, 24]               0
          Conv2d-141           [1, 512, 24, 24]         524,288
     BatchNorm2d-142           [1, 512, 24, 24]           1,024
            ReLU-143           [1, 512, 24, 24]               0
          Conv2d-144           [1, 512, 12, 12]       2,359,296
     BatchNorm2d-145           [1, 512, 12, 12]           1,024
            ReLU-146           [1, 512, 12, 12]               0
          Conv2d-147          [1, 2048, 12, 12]       1,048,576
     BatchNorm2d-148          [1, 2048, 12, 12]           4,096
          Conv2d-149          [1, 2048, 12, 12]       2,097,152
     BatchNorm2d-150          [1, 2048, 12, 12]           4,096
            ReLU-151          [1, 2048, 12, 12]               0
      Bottleneck-152          [1, 2048, 12, 12]               0
          Conv2d-153           [1, 512, 12, 12]       1,048,576
     BatchNorm2d-154           [1, 512, 12, 12]           1,024
            ReLU-155           [1, 512, 12, 12]               0
          Conv2d-156           [1, 512, 12, 12]       2,359,296
     BatchNorm2d-157           [1, 512, 12, 12]           1,024
            ReLU-158           [1, 512, 12, 12]               0
          Conv2d-159          [1, 2048, 12, 12]       1,048,576
     BatchNorm2d-160          [1, 2048, 12, 12]           4,096
            ReLU-161          [1, 2048, 12, 12]               0
      Bottleneck-162          [1, 2048, 12, 12]               0
          Conv2d-163           [1, 512, 12, 12]       1,048,576
     BatchNorm2d-164           [1, 512, 12, 12]           1,024
            ReLU-165           [1, 512, 12, 12]               0
          Conv2d-166           [1, 512, 12, 12]       2,359,296
     BatchNorm2d-167           [1, 512, 12, 12]           1,024
            ReLU-168           [1, 512, 12, 12]               0
          Conv2d-169          [1, 2048, 12, 12]       1,048,576
     BatchNorm2d-170          [1, 2048, 12, 12]           4,096
            ReLU-171          [1, 2048, 12, 12]               0
      Bottleneck-172          [1, 2048, 12, 12]               0
 ConvTranspose2d-173          [1, 1024, 24, 24]      33,555,456
          Conv2d-174           [1, 256, 24, 24]         524,288
     BatchNorm2d-175           [1, 256, 24, 24]             512
            ReLU-176           [1, 256, 24, 24]               0
          Conv2d-177           [1, 256, 24, 24]         589,824
     BatchNorm2d-178           [1, 256, 24, 24]             512
            ReLU-179           [1, 256, 24, 24]               0
          Conv2d-180          [1, 1024, 24, 24]         262,144
     BatchNorm2d-181          [1, 1024, 24, 24]           2,048
          Conv2d-182          [1, 1024, 24, 24]       2,097,152
     BatchNorm2d-183          [1, 1024, 24, 24]           2,048
            ReLU-184          [1, 1024, 24, 24]               0
      Bottleneck-185          [1, 1024, 24, 24]               0
    DecoderBlock-186          [1, 1024, 24, 24]               0
 ConvTranspose2d-187           [1, 512, 48, 48]       8,389,120
          Conv2d-188           [1, 128, 48, 48]         131,072
     BatchNorm2d-189           [1, 128, 48, 48]             256
            ReLU-190           [1, 128, 48, 48]               0
          Conv2d-191           [1, 128, 48, 48]         147,456
     BatchNorm2d-192           [1, 128, 48, 48]             256
            ReLU-193           [1, 128, 48, 48]               0
          Conv2d-194           [1, 512, 48, 48]          65,536
     BatchNorm2d-195           [1, 512, 48, 48]           1,024
          Conv2d-196           [1, 512, 48, 48]         524,288
     BatchNorm2d-197           [1, 512, 48, 48]           1,024
            ReLU-198           [1, 512, 48, 48]               0
      Bottleneck-199           [1, 512, 48, 48]               0
    DecoderBlock-200           [1, 512, 48, 48]               0
 ConvTranspose2d-201           [1, 256, 96, 96]       2,097,408
          Conv2d-202            [1, 64, 96, 96]          32,768
     BatchNorm2d-203            [1, 64, 96, 96]             128
            ReLU-204            [1, 64, 96, 96]               0
          Conv2d-205            [1, 64, 96, 96]          36,864
     BatchNorm2d-206            [1, 64, 96, 96]             128
            ReLU-207            [1, 64, 96, 96]               0
          Conv2d-208           [1, 256, 96, 96]          16,384
     BatchNorm2d-209           [1, 256, 96, 96]             512
          Conv2d-210           [1, 256, 96, 96]         131,072
     BatchNorm2d-211           [1, 256, 96, 96]             512
            ReLU-212           [1, 256, 96, 96]               0
      Bottleneck-213           [1, 256, 96, 96]               0
    DecoderBlock-214           [1, 256, 96, 96]               0
 ConvTranspose2d-215          [1, 64, 192, 192]         262,208
          Conv2d-216          [1, 16, 192, 192]           2,048
     BatchNorm2d-217          [1, 16, 192, 192]              32
            ReLU-218          [1, 16, 192, 192]               0
          Conv2d-219          [1, 16, 192, 192]           2,304
     BatchNorm2d-220          [1, 16, 192, 192]              32
            ReLU-221          [1, 16, 192, 192]               0
          Conv2d-222          [1, 64, 192, 192]           1,024
     BatchNorm2d-223          [1, 64, 192, 192]             128
          Conv2d-224          [1, 64, 192, 192]           8,192
     BatchNorm2d-225          [1, 64, 192, 192]             128
            ReLU-226          [1, 64, 192, 192]               0
      Bottleneck-227          [1, 64, 192, 192]               0
    DecoderBlock-228          [1, 64, 192, 192]               0
          Conv2d-229           [1, 3, 192, 192]           1,731
          Conv2d-230           [1, 1, 192, 192]              28
================================================================
Total params: 72,395,679
Trainable params: 72,395,679
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.69
Forward/backward pass size (MB): 1313.44
Params size (MB): 276.17
Estimated Total Size (MB): 1591.29